src/main/resources/groovy-extension.txt

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:arg="http://www.navis.com/services/argoservice">
   <soapenv:Header/>
   <soapenv:Body>
      <arg:genericInvoke>
         <arg:scopeCoordinateIdsWsType>
			<operatorId>#operator#</operatorId>
			<complexId>#complex#</complexId>
			<facilityId>#facility#</facilityId>
			<yardId>#yard#</yardId>
		</arg:scopeCoordinateIdsWsType>
         <arg:xmlDoc>
         <![CDATA[
			<groovy class-name="#code-extension#" class-location="code-extension">
                <parameters>
                    <parameter id="entity-name" value="#entity-name#"/>
                    <parameter id="entity-item" value="#entity-item#"/>
                </parameters>
            </groovy>
		]]>
		</arg:xmlDoc>
      </arg:genericInvoke>
   </soapenv:Body>
</soapenv:Envelope>